#### Terraform Plan 📖
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project_service.required_apis["cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.required_apis["compute.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "compute.googleapis.com"
    }

  # google_project_service.required_apis["container.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "container.googleapis.com"
    }

  # google_project_service.required_apis["gkehub.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "gkehub.googleapis.com"
    }

  # google_project_service.required_apis["iam.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "iam.googleapis.com"
    }

  # google_project_service.required_apis["logging.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "logging.googleapis.com"
    }

  # google_project_service.required_apis["mesh.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "mesh.googleapis.com"
    }

  # google_project_service.required_apis["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "monitoring.googleapis.com"
    }

  # google_project_service.required_apis["servicenetworking.googleapis.com"] will be created
  + resource "google_project_service" "required_apis" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.anthos_service_mesh.google_gke_hub_feature.mesh will be created
  + resource "google_gke_hub_feature" "mesh" {
      + create_time      = (known after apply)
      + delete_time      = (known after apply)
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + location         = "global"
      + name             = "servicemesh"
      + project          = "infra-474223"
      + resource_state   = (known after apply)
      + state            = (known after apply)
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)
    }

  # module.anthos_service_mesh.google_gke_hub_feature_membership.mesh_feature_membership["app-engine"] will be created
  + resource "google_gke_hub_feature_membership" "mesh_feature_membership" {
      + feature    = "servicemesh"
      + id         = (known after apply)
      + location   = "global"
      + membership = "app-engine-membership"
      + project    = "infra-474223"

      + mesh {
          + management = "MANAGEMENT_AUTOMATIC"
        }
    }

  # module.anthos_service_mesh.google_gke_hub_feature_membership.mesh_feature_membership["master-engine"] will be created
  + resource "google_gke_hub_feature_membership" "mesh_feature_membership" {
      + feature    = "servicemesh"
      + id         = (known after apply)
      + location   = "global"
      + membership = "master-engine-membership"
      + project    = "infra-474223"

      + mesh {
          + management = "MANAGEMENT_AUTOMATIC"
        }
    }

  # module.anthos_service_mesh.google_gke_hub_membership.memberships["app-engine"] will be created
  + resource "google_gke_hub_membership" "memberships" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + location         = "global"
      + membership_id    = "app-engine-membership"
      + name             = (known after apply)
      + project          = "infra-474223"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + endpoint {
          + gke_cluster {
              + resource_link = "//container.googleapis.com/projects/infra-474223/locations/us-east1-b/clusters/app-engine"
            }
        }
    }

  # module.anthos_service_mesh.google_gke_hub_membership.memberships["master-engine"] will be created
  + resource "google_gke_hub_membership" "memberships" {
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + id               = (known after apply)
      + location         = "global"
      + membership_id    = "master-engine-membership"
      + name             = (known after apply)
      + project          = "infra-474223"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }

      + endpoint {
          + gke_cluster {
              + resource_link = "//container.googleapis.com/projects/infra-474223/locations/us-central1-a/clusters/master-engine"
            }
        }
    }

  # module.anthos_service_mesh.google_project_service.gkehub_api will be created
  + resource "google_project_service" "gkehub_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "gkehub.googleapis.com"
    }

  # module.anthos_service_mesh.google_project_service.mesh_api will be created
  + resource "google_project_service" "mesh_api" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "infra-474223"
      + service            = "mesh.googleapis.com"
    }

  # module.gke_clusters.google_container_cluster.clusters["app-engine"] will be created
  + resource "google_container_cluster" "clusters" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-east1-b"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "app-engine"
      + network                                  = "main-vpc"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "infra-474223"
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "environment" = "production"
          + "managed-by"  = "terraform"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "subnet-us-east1"
      + terraform_labels                         = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = false
            }
        }

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + recurring_window {
              + end_time   = "2024-01-01T15:00:00Z"
              + recurrence = "FREQ=WEEKLY;BYDAY=SU"
              + start_time = "2024-01-01T03:00:00Z"
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]

          + managed_prometheus {
              + enabled = true
            }
        }

      + network_policy {
          + enabled = true
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = (known after apply)
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "infra-474223.svc.id.goog"
        }
    }

  # module.gke_clusters.google_container_cluster.clusters["master-engine"] will be created
  + resource "google_container_cluster" "clusters" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = (known after apply)
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + disable_l4_lb_firewall_reconciliation    = false
      + effective_labels                         = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_fqdn_network_policy               = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "us-central1-a"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "master-engine"
      + network                                  = "main-vpc"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = "infra-474223"
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "environment" = "production"
          + "managed-by"  = "terraform"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "subnet-us-central1"
      + terraform_labels                         = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config {
          + gce_persistent_disk_csi_driver_config {
              + enabled = true
            }
          + horizontal_pod_autoscaling {
              + disabled = false
            }
          + http_load_balancing {
              + disabled = false
            }
          + network_policy_config {
              + disabled = false
            }
        }

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4"
        }

      + logging_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
              + "WORKLOADS",
            ]
        }

      + maintenance_policy {
          + recurring_window {
              + end_time   = "2024-01-01T15:00:00Z"
              + recurrence = "FREQ=WEEKLY;BYDAY=SU"
              + start_time = "2024-01-01T03:00:00Z"
            }
        }

      + monitoring_config {
          + enable_components = [
              + "SYSTEM_COMPONENTS",
            ]

          + managed_prometheus {
              + enabled = true
            }
        }

      + network_policy {
          + enabled = true
        }

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = (known after apply)
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)
        }

      + release_channel {
          + channel = "REGULAR"
        }

      + workload_identity_config {
          + workload_pool = "infra-474223.svc.id.goog"
        }
    }

  # module.gke_clusters.google_container_node_pool.node_pools["app-engine"] will be created
  + resource "google_container_node_pool" "node_pools" {
      + cluster                     = "app-engine"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1-b"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "app-engine-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "infra-474223"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 5
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb     = 50
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = "COS_CONTAINERD"
          + labels           = {
              + "cluster" = "app-engine"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-medium"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = false

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # module.gke_clusters.google_container_node_pool.node_pools["master-engine"] will be created
  + resource "google_container_node_pool" "node_pools" {
      + cluster                     = "master-engine"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "master-engine-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "infra-474223"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 5
          + min_node_count  = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb     = 50
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = "COS_CONTAINERD"
          + labels           = {
              + "cluster" = "master-engine"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-medium"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
            ]
          + preemptible      = false
          + service_account  = (known after apply)
          + spot             = false

          + workload_metadata_config {
              + mode = "GKE_METADATA"
            }
        }
    }

  # module.vpc.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "main-vpc-allow-internal"
      + network            = "main-vpc"
      + priority           = 65534
      + project            = "infra-474223"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.1.0/24",
          + "10.0.2.0/24",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.google_compute_network.vpc[0] will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "main-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "infra-474223"
      + routing_mode                              = "REGIONAL"
      + self_link                                 = (known after apply)
    }

  # module.vpc.google_compute_router.router["us-central1"] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "router-us-central1"
      + network            = (known after apply)
      + project            = "infra-474223"
      + region             = "us-central1"
      + self_link          = (known after apply)
    }

  # module.vpc.google_compute_router.router["us-east1"] will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "router-us-east1"
      + network            = (known after apply)
      + project            = "infra-474223"
      + region             = "us-east1"
      + self_link          = (known after apply)
    }

  # module.vpc.google_compute_router_nat.nat["us-central1"] will be created
  + resource "google_compute_router_nat" "nat" {
      + auto_network_tier                   = (known after apply)
      + drain_nat_ips                       = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "nat-us-central1"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "infra-474223"
      + region                              = "us-central1"
      + router                              = "router-us-central1"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + type                                = "PUBLIC"
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.vpc.google_compute_router_nat.nat["us-east1"] will be created
  + resource "google_compute_router_nat" "nat" {
      + auto_network_tier                   = (known after apply)
      + drain_nat_ips                       = (known after apply)
      + enable_dynamic_port_allocation      = (known after apply)
      + enable_endpoint_independent_mapping = (known after apply)
      + endpoint_types                      = (known after apply)
      + icmp_idle_timeout_sec               = 30
      + id                                  = (known after apply)
      + min_ports_per_vm                    = (known after apply)
      + name                                = "nat-us-east1"
      + nat_ip_allocate_option              = "AUTO_ONLY"
      + nat_ips                             = (known after apply)
      + project                             = "infra-474223"
      + region                              = "us-east1"
      + router                              = "router-us-east1"
      + source_subnetwork_ip_ranges_to_nat  = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec    = 1200
      + tcp_time_wait_timeout_sec           = 120
      + tcp_transitory_idle_timeout_sec     = 30
      + type                                = "PUBLIC"
      + udp_idle_timeout_sec                = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.vpc.google_compute_subnetwork.subnets["subnet-us-central1"] will be created
  + resource "google_compute_subnetwork" "subnets" {
      + creation_timestamp         = (known after apply)
      + description                = "Subnet for us-central1 region"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.1.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "subnet-us-central1"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "infra-474223"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range = "10.1.0.0/16"
          + range_name    = "pods"
        }
      + secondary_ip_range {
          + ip_cidr_range = "10.2.0.0/20"
          + range_name    = "services"
        }
    }

  # module.vpc.google_compute_subnetwork.subnets["subnet-us-east1"] will be created
  + resource "google_compute_subnetwork" "subnets" {
      + creation_timestamp         = (known after apply)
      + description                = "Subnet for us-east1 region"
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.2.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "subnet-us-east1"
      + network                    = (known after apply)
      + private_ip_google_access   = true
      + private_ipv6_google_access = (known after apply)
      + project                    = "infra-474223"
      + purpose                    = (known after apply)
      + region                     = "us-east1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range {
          + ip_cidr_range = "10.3.0.0/16"
          + range_name    = "pods"
        }
      + secondary_ip_range {
          + ip_cidr_range = "10.4.0.0/20"
          + range_name    = "services"
        }
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + anthos_service_mesh_status = (sensitive value)
  + cluster_endpoints          = (sensitive value)
  + gke_clusters               = (sensitive value)
  + network_name               = "main-vpc"
  + network_self_link          = (known after apply)
  + project_id                 = "infra-474223"
  + subnets                    = {
      + subnet-us-central1 = {
          + id                  = (known after apply)
          + ip_cidr_range       = "10.0.1.0/24"
          + name                = "subnet-us-central1"
          + region              = "us-central1"
          + secondary_ip_ranges = [
              + {
                  + ip_cidr_range           = "10.1.0.0/16"
                  + range_name              = "pods"
                  + reserved_internal_range = null
                },
              + {
                  + ip_cidr_range           = "10.2.0.0/20"
                  + range_name              = "services"
                  + reserved_internal_range = null
                },
            ]
          + self_link           = (known after apply)
        }
      + subnet-us-east1    = {
          + id                  = (known after apply)
          + ip_cidr_range       = "10.0.2.0/24"
          + name                = "subnet-us-east1"
          + region              = "us-east1"
          + secondary_ip_ranges = [
              + {
                  + ip_cidr_range           = "10.3.0.0/16"
                  + range_name              = "pods"
                  + reserved_internal_range = null
                },
              + {
                  + ip_cidr_range           = "10.4.0.0/20"
                  + range_name              = "services"
                  + reserved_internal_range = null
                },
            ]
          + self_link           = (known after apply)
        }
    }

```
*Pusher: @gabaws, Action: `pull_request`*